#!/usr/bin/env perl

use strict;
use warnings;
use v5.014;


#
# flatten е функция, която взима списък и връща сплескания му вариант.  Понеже
# в Perl списък от списъци може единствено да се създаде с референции, това е
# еквивалентно на рекурсивното дереференциране на списъците в подадения като
# вход списък.
sub flatten {
  my @arr = ref $_[0] eq 'ARRAY' ? # референция ли получаваме?
    @{$_[0]} : # ако да, дереференцираме
    @_;        # иначе работим със списък
  my @flat_arr;

  for my $a (@arr) { # минаваме по всички елементи на списъка
    if (ref $a eq 'ARRAY') { # ако са референции, влизаме навътре
      @flat_arr = (@flat_arr, flatten($a));
    } else { # иначе ги добавяме към сплескания списък
      push @flat_arr, $a;
    }
  }

  return @flat_arr;
}

$, = ' ';
say flatten([1, 2, 3, 4]);
say flatten(1, 2, 3, 4);
say flatten([1, [2, 3], 4]);
say flatten([1, [1, 1, 1], [2, [3, 4], 5], [6, [7]]]);
say flatten([[[[]]]]);
say flatten([[[1]]]);
